//
// Created by Administrator on 2022/9/30.
//

/*
 * STL(Standard Template Library)
 *
 *
 * 1.容器: 数据结构，用来存储数据（类模板实现）
 * 2.算法: 对数据的各种操作（函数模板实现）
 * 3.迭代器: 胶水，算法通过迭代器来操作容器里面的数据
 * 4.仿函数: 自定义算法
 * 5.分配器: 负责空间的配置与管理，是一个实现了动态空间分配与释放的类模板
 * 6.适配器: 修饰容器或迭代器
 *
 *
 * STL三大组件【容器、算法、迭代器】
 * 1.容器
 *      顺序容器（array，vector，deque，list）
 *      关联容器（map，set）
 *      无需容器（unordered_set, unorderd_map）
 *
 * 2.算法
 *      质变算法：算法过程会改变空间的元素内容（copy，删除，替换）
 *      非质变算法：不会改变（查找、遍历、计数）
 *
 * 3，迭代器
 *      输入迭代器
 *      输出迭代器
 *      前向迭代器
 *      双向迭代器
 *      随机迭代器
 * */